#### Terraform Validation & Plan Results
* Terraform Version 📎`1.6.6`
* Working Directory 📂`./code/infra`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_subscription.current: Reading...[0m[0m
[0m[1mdata.azurerm_location.current: Reading...[0m[0m
[0m[1mazurerm_resource_group.resource_group_dataeng: Refreshing state... [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-dataeng-rg][0m
[0m[1mazurerm_resource_group.resource_group_storage: Refreshing state... [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-stg-rg][0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00NDljMTk5OC1lYzgwLTQ4NmQtYjkwYi02MTRlZDFjMzE3Zjg7b2JqZWN0SWQ9Y2IxMTMzNjgtYWI0NC00YjU4LWI2NzgtYjA0Y2I5YWJhNDE3O3N1YnNjcmlwdGlvbklkPWJlMjU4MjBhLWRmODYtNDc5NC05ZTk1LTZhNDVjZDVjMDk0MTt0ZW5hbnRJZD01NzJjZjFlYy0zZjkwLTQ5YTItODk2Zi1hYjJmYTM2Y2EwZDM=][0m
[0m[1mazurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-dataeng-rg/providers/Microsoft.KeyVault/vaults/sc4-dev-vault001][0m
[0m[1mazurerm_kusto_cluster.kusto_cluster: Refreshing state... [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-dataeng-rg/providers/Microsoft.Kusto/clusters/sc4-dev-kusto001][0m
[0m[1mazurerm_data_factory.data_factory: Refreshing state... [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-dataeng-rg/providers/Microsoft.DataFactory/factories/sc4-dev-df001][0m
[0m[1mazurerm_storage_account.storage: Refreshing state... [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-stg-rg/providers/Microsoft.Storage/storageAccounts/sc4devstg001][0m
[0m[1mdata.azurerm_subscription.current: Read complete after 0s [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_kusto_cluster: Reading...[0m[0m
[0m[1mazurerm_kusto_database.kusto_database["operationaldb"]: Refreshing state... [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-dataeng-rg/providers/Microsoft.Kusto/clusters/sc4-dev-kusto001/databases/operationaldb][0m
[0m[1mazurerm_data_factory_managed_private_endpoint.data_factory_managed_private_endpoint_kusto_cluster: Refreshing state... [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-dataeng-rg/providers/Microsoft.DataFactory/factories/sc4-dev-df001/managedVirtualNetworks/default/managedPrivateEndpoints/AzureDataExplorer][0m
[0m[1mazurerm_kusto_database_principal_assignment.data_factory_kusto_database_principal_assignment_ingestor["operationaldb"]: Refreshing state... [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-dataeng-rg/providers/Microsoft.Kusto/clusters/sc4-dev-kusto001/databases/operationaldb/principalAssignments/operationaldb-Ingestor-sc4-dev-df001][0m
[0m[1mazurerm_kusto_database_principal_assignment.data_factory_kusto_database_principal_assignment_viewer["operationaldb"]: Refreshing state... [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-dataeng-rg/providers/Microsoft.Kusto/clusters/sc4-dev-kusto001/databases/operationaldb/principalAssignments/operationaldb-Viewer-sc4-dev-df001][0m
[0m[1mazurerm_kusto_database_principal_assignment.data_factory_kusto_database_principal_assignment_admin["operationaldb"]: Refreshing state... [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-dataeng-rg/providers/Microsoft.Kusto/clusters/sc4-dev-kusto001/databases/operationaldb/principalAssignments/operationaldb-Admin-sc4-dev-df001][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_kusto_cluster: Read complete after 0s [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-dataeng-rg/providers/Microsoft.Kusto/clusters/sc4-dev-kusto001][0m
[0m[1mdata.azurerm_location.current: Read complete after 1s [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/locations/germanywestcentral][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Reading...[0m[0m
[0m[1mazurerm_role_assignment.current_role_assignment_key_vault: Refreshing state... [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-dataeng-rg/providers/Microsoft.KeyVault/vaults/sc4-dev-vault001/providers/Microsoft.Authorization/roleAssignments/0f0fdc3c-5961-441f-f811-019b6a6bc73a][0m
[0m[1mazurerm_role_assignment.data_factory_role_assignment_key_vault: Refreshing state... [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-dataeng-rg/providers/Microsoft.KeyVault/vaults/sc4-dev-vault001/providers/Microsoft.Authorization/roleAssignments/c9f180cf-8a11-d590-165d-eb053e78cc79][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Read complete after 1s [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-dataeng-rg/providers/Microsoft.KeyVault/vaults/sc4-dev-vault001][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage: Reading...[0m[0m
[0m[1mazurerm_role_assignment.current_role_assignment_storage: Refreshing state... [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-stg-rg/providers/Microsoft.Storage/storageAccounts/sc4devstg001/providers/Microsoft.Authorization/roleAssignments/ae99ddc5-4a50-2614-6069-a367972993f8][0m
[0m[1mazurerm_role_assignment.data_factory_role_assignment_storage: Refreshing state... [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-stg-rg/providers/Microsoft.Storage/storageAccounts/sc4devstg001/providers/Microsoft.Authorization/roleAssignments/b27b6bd8-2689-3b3c-3ee5-eb0b22dffa41][0m
[0m[1mazurerm_storage_container.storage_container["logs"]: Refreshing state... [id=https://sc4devstg001.blob.core.windows.net/logs][0m
[0m[1mazurerm_storage_container.storage_container["curated"]: Refreshing state... [id=https://sc4devstg001.blob.core.windows.net/curated][0m
[0m[1mazurerm_storage_container.storage_container["upload-ott"]: Refreshing state... [id=https://sc4devstg001.blob.core.windows.net/upload-ott][0m
[0m[1mazurerm_storage_container.storage_container["raw"]: Refreshing state... [id=https://sc4devstg001.blob.core.windows.net/raw][0m
[0m[1mazurerm_storage_container.storage_container["upload-iptv"]: Refreshing state... [id=https://sc4devstg001.blob.core.windows.net/upload-iptv][0m
[0m[1mdata.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage: Read complete after 0s [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-stg-rg/providers/Microsoft.Storage/storageAccounts/sc4devstg001][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_data_factory[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_data_factory" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m logs                = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = "/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-dataeng-rg/providers/Microsoft.DataFactory/factories/sc4-dev-df001"
    }

[1m  # azurerm_data_factory.data_factory[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_data_factory" "data_factory" {
        id                              = "/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-dataeng-rg/providers/Microsoft.DataFactory/factories/sc4-dev-df001"
        name                            = "sc4-dev-df001"
        tags                            = {}
        [90m# (4 unchanged attributes hidden)[0m[0m

      [32m+[0m[0m global_parameter {
          [32m+[0m[0m name  = "movingWindowInMinutes"
          [32m+[0m[0m type  = "Float"
          [32m+[0m[0m value = "30.0"
        }

        [90m# (3 unchanged blocks hidden)[0m[0m
    }

[1m  # azurerm_kusto_script.kusto_script["operationaldb"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_kusto_script" "kusto_script" {
      [32m+[0m[0m continue_on_errors_enabled         = false
      [32m+[0m[0m database_id                        = "/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-dataeng-rg/providers/Microsoft.Kusto/clusters/sc4-dev-kusto001/databases/operationaldb"
      [32m+[0m[0m force_an_update_when_value_changed = "Ly8gQ3JlYXRlIHJhdyB0YWJsZXMgCi5jcmVhdGUtbWVyZ2UgdGFibGVzCiAgICBvdHRfcmF3KAogICAgICAgIENvdW50cnk6IHN0cmluZywKICAgICAgICBJc3A6IHN0cmluZywKICAgICAgICBDZG5Ob2RlSG9zdDogc3RyaW5nLAogICAgICAgIFR5cGU6IHN0cmluZywKICAgICAgICBUaXRsZTogc3RyaW5nLAogICAgICAgIFNlbGVjdGVkUXVhbGl0eTogc3RyaW5nLAogICAgICAgIERldmljZVR5cGU6IHN0cmluZywKICAgICAgICBWZXJzaW9uOiBzdHJpbmcsCiAgICAgICAgQ29ubmVjdGlvbjogc3RyaW5nLAogICAgICAgIENvbW1lcmNpbGl6YXRpb25UeXBlOiBzdHJpbmcsCiAgICAgICAgRGV2aWNlVmVuZG9yOiBzdHJpbmcsCiAgICAgICAgSGFwcGluZXNzU2NvcmU6IHJlYWwsCiAgICAgICAgVXNlcklkOiBzdHJpbmcKICAgICksCiAgICBpcHR2X3JhdygKICAgICAgICBBcHBWZXJzaW9uOiBzdHJpbmcsCiAgICAgICAgQ291bnRyeTogc3RyaW5nLAogICAgICAgIEhhcHBpbmVzc1Njb3JlOiByZWFsLAogICAgICAgIEh3TW9kZWw6IHN0cmluZywKICAgICAgICBTZXJ2aWNlOiBzdHJpbmcsCiAgICAgICAgU2VydmljZVR5cGU6IHN0cmluZywKICAgICAgICBTdGJNb2RlbDogc3RyaW5nLAogICAgICAgIFN0cmVhbWluZ1Byb3RvY29sOiBzdHJpbmcsCiAgICAgICAgVGl0bGU6IHN0cmluZywKICAgICAgICBUb3BvbG9neTI6IHN0cmluZywKICAgICAgICBUb3BvbG9neTM6IHN0cmluZywKICAgICAgICBUb3BvbG9neTQ6IHN0cmluZywKICAgICAgICBUb3BvbG9neTU6IHN0cmluZywKICAgICAgICBUdk1vZGVsOiBzdHJpbmcsCiAgICAgICAgVXNlcklkOiBzdHJpbmcKICAgICkKCi8vIENyZWF0ZSBoZWxwZXIgdGFibGVzCi5jcmVhdGUtbWVyZ2UgdGFibGVzCiAgICB0aHJlc2hvbGRzICgKICAgICAgICBuYW1lOiBzdHJpbmcsCiAgICAgICAgdmFsdWU6IHJlYWwsCiAgICAgICAgdGltZXN0YW1wOiBkYXRldGltZQogICAgKQo="
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m name                               = "init-db-operationaldb"
      [32m+[0m[0m script_content                     = (sensitive value)
    }

[1mPlan:[0m 1 to add, 1 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>